[{"id":"COSC 4363","deptID":"COSC","courseNumber":4363,"name":"Contingency Planning","description":"The principles of disaster recovery and business continuity planning, and examines countermeasures that may be used to prevent system failure for an organization. The use of hot sites, warm sites, cold sites, and virtualization technology that allow the organization to continue operations after a disaster will also be covered.","prerequisites":[],"corequisites":[],"requirementsTo":[]},{"id":"COSC 4342","deptID":"COSC","courseNumber":4342,"name":"Sports Data Analytics","description":"Identifying the metrics, types of analyses and making sense of sports-related data from a managerial business perspective. Use of industry tools to gather, learn, make predictions and visualize large sports data sets.","prerequisites":["MATH 1342","MATH 1343"],"corequisites":[],"requirementsTo":[]},{"id":"COSC 3315","deptID":"COSC","courseNumber":3315,"name":"Social and Professional Issues in Computing","description":"Introduction to the social and professional issues that arise in the context of computing.","prerequisites":["COSC 1337"],"corequisites":[],"requirementsTo":["CSCI 4385","COSC 4395"]},{"id":"COSC 4375","deptID":"COSC","courseNumber":4375,"name":"Information Systems Design Project","description":"An integrated perspective of the problems in today's information systems environment, concentration on contemporary design, methodologies, and considerations unique to users of computers and information systems.","prerequisites":["COSC 3375","COSC 3385","COSC 4325"],"corequisites":[],"requirementsTo":[]},{"id":"COSC 3331","deptID":"COSC","courseNumber":3331,"name":"E-Commerce Programming","description":"The course deals with the technical aspects of e-commerce. Students will learn to design, build, and maintain a complete e-commerce website. Topics include: e-commerce modeling, designing, and implementing a website that meets user requirements, maintaining and setting up web servers, multi-tiered web architecture, database servers, accessing remote databases, shopping cart fundamentals, commerce server, advertising on the web, e-cash and electronic payments, and Internet security and encryption. Students will build their own projects.","prerequisites":["COSC 1337"],"corequisites":[],"requirementsTo":[]},{"id":"COSC 5326","deptID":"COSC","courseNumber":5326,"name":"UNIX Programming Environment","description":"This course will cover shell programming, filters, I/O programming, program development, and document preparation. Special attention will be given to UNIX systems programming.","prerequisites":[],"corequisites":[],"requirementsTo":[]},{"id":"COSC 5366","deptID":"COSC","courseNumber":5366,"name":"Compiler Techniques","description":"Characteristics of the compiling process, syntax directed compiling, symbol table construction and searching, top down and bottom up methods, formal grammars, and a formalization of syntax.","prerequisites":[],"corequisites":[],"requirementsTo":[]},{"id":"COSC 3365","deptID":"COSC","courseNumber":3365,"name":"Programming with Data, File and Object Structures","description":"This course covers computer concepts, algorithm development, programming and program validation. It includes a special emphasis on the design and application of data and file structures.","prerequisites":["COSC 1337"],"corequisites":[],"requirementsTo":[]},{"id":"COSC 4367","deptID":"COSC","courseNumber":4367,"name":"Cryptography","description":"An overview to cryptography, which includes classical encryption, block ciphers and DES, public key cryptography, hashing, message authentication, key management, digital signatures, user authentication, transport layer security, wireless security, and e-mail security.","prerequisites":["COSC 4325","COSC 4360"],"corequisites":[],"requirementsTo":[]},{"id":"COSC 5392","deptID":"COSC","courseNumber":5392,"name":"Graduate Internship Program","description":"A regular academic or extended summer semester program providing for a learning experience in a computing environment, at the graduate level of study. A written report and a presentation describing the activities and accomplishments of the student during the internship is required at the conclusion of the internship period. A maximum of three credit hours may be applied toward the graduate degree.","prerequisites":[],"corequisites":[],"requirementsTo":[]},{"id":"COSC 5396","deptID":"COSC","courseNumber":5396,"name":"Thesis","description":"Completion and approval of thesis.","prerequisites":[],"corequisites":[],"requirementsTo":[]},{"id":"COSC 3375","deptID":"COSC","courseNumber":3375,"name":"Analysis and Logical Design","description":"This course introduces the systems development process. Topics covered include structured and object-oriented analysis and design, use of modeling tools, the methodological life cycle and project management. It includes the study of interpersonal skill development with clients, users, team members, and others associated with the development, operation and maintenance of systems.","prerequisites":["COSC 1337"],"corequisites":[],"requirementsTo":["COSC 4375"]},{"id":"COSC 4385","deptID":"COSC","courseNumber":4385,"name":"Database Management Concepts","description":"Database system architecture; file structures for databases, including indexing, hashing, and B+ trees, the relational model and algebra; the SQL database language; alternative database systems (network, hierarchical, object-oriented, object-relational, logical implementation, temporal, etc.), conceptual data modeling including Entity-Relationship data modeling; advanced data modeling concepts; functional dependencies, basic normalization, and database security management.","prerequisites":["COSC 2336"],"corequisites":[],"requirementsTo":["COSC 4395","COSC 4373"]},{"id":"COSC 4325","deptID":"COSC","courseNumber":4325,"name":"Data Communications and Computer Networks","description":"Study of problems and limitations associated with interconnecting computers by communication networks. OSI reference model, architecture of circuits, message and packet switching networks, network topology, routing, flow control, capacity assignments, protocols, coding and multiplexing.","prerequisites":[],"corequisites":[],"requirementsTo":["COSC 4375","COSC 4367","COSC 4364","COSC 4361"]},{"id":"COSC 4360","deptID":"COSC","courseNumber":4360,"name":"Net-Centric Computing","description":"Introduces the structure, implementation, and theoretical underpinnings of computer networking and the applications that have been enabled by that technology.","prerequisites":["COSC 2315","COSC 2336"],"corequisites":[],"requirementsTo":["COSC 4367","COSC 4395","COSC 4364","COSC 4361"]},{"id":"COSC 1337","deptID":"COSC","courseNumber":1337,"name":"The Object-Oriented Paradigm","description":"Introduction to the concepts of object-oriented programming to students with a background in the procedural paradigm. Topics covered include a review of control structures and data types, the object-oriented programming paradigm, object-oriented design, an overview of programming language principles, simple analysis of algorithms, basic searching and sorting techniques, and an introduction to software engineering issues.","prerequisites":["COSC 1336","COSC 1315"],"corequisites":[],"requirementsTo":["COSC 3315","COSC 3331","COSC 3365","COSC 3375","COSC 3385","COSC 3310","COSC 2336"]},{"id":"COSC 3333","deptID":"COSC","courseNumber":3333,"name":"Management Information Systems","description":"This course is a survey of the tools and techniques for the gathering of business information and structuring and manipulation of data to support managerial decision making. Main topic areas include decision support system technology, artificial intelligence tools, expert systems and business applications such as SAP.","prerequisites":["COSC 1307"],"corequisites":[],"requirementsTo":["COSC 4312"]},{"id":"COSC 4395","deptID":"COSC","courseNumber":4395,"name":"Capstone Project","description":"This course offers students the opportunity to integrate their knowledge of the undergraduate computer science curriculum by implementing a significant software system as part of a programming team.","prerequisites":["COSC 3315","COSC 3325","COSC 3345","COSC 4315","COSC 4336","COSC 4360","COSC 4385"],"corequisites":[],"requirementsTo":[]},{"id":"COSC 4364","deptID":"COSC","courseNumber":4364,"name":"Cyber Risk Analysis","description":"Introduction to the basics of information systems assessment, evaluation, and red teaming. Students use the National Security Agency’s ISAM Methodology to evaluate vulnerabilities and to develop appropriate responses to mitigate security risks. The students participate in a term long assessment/evaluation project in this course with an actual organization.","prerequisites":["COSC 4325","COSC 4360"],"corequisites":[],"requirementsTo":[]},{"id":"COSC 4352","deptID":"COSC","courseNumber":4352,"name":"Data Mining","description":"The course deals with knowledge discovery from databases (KDD). Topics covered in the course include data warehousing, model fitting, classification, prediction, clustering, market basket analysis, extracting knowledge from data models, and data visualization techniques.","prerequisites":["COSC 2336"],"corequisites":[],"requirementsTo":[]},{"id":"COSC 3385","deptID":"COSC","courseNumber":3385,"name":"Database Design","description":"This course covers information systems design and implementation within a database management system environment. Students will design and construct a system using database software to implement the logical design.","prerequisites":["COSC 1337"],"corequisites":[],"requirementsTo":["COSC 4375","CSCI 4385"]},{"id":"COSC 5390","deptID":"COSC","courseNumber":5390,"name":"Topics in Computer Science","description":"This course can be taken up to two times for credit when content changes.","prerequisites":[],"corequisites":[],"requirementsTo":[]},{"id":"COSC 5388","deptID":"COSC","courseNumber":5388,"name":"Digital Forensics","description":"Prepares students to collect, examine, and preserve digital evidence; and examines techniques used to prepare for, respond to, and investigate cyberspace incidents.","prerequisites":[],"corequisites":[],"requirementsTo":[]},{"id":"COSC 5342","deptID":"COSC","courseNumber":5342,"name":"Cybersecurity Management","description":"This course will cover the techniques used to secure and manage computers, computer networks, and enterprise computer systems. Topics covered will include security policies, computer network management, and disaster recovery.","prerequisites":[],"corequisites":[],"requirementsTo":[]},{"id":"COSC 5330","deptID":"COSC","courseNumber":5330,"name":"Operating Systems","description":"Analysis of operating systems software for computing systems, and resource management procedures and techniques used in all types of computing environments. Topics include processes, synchronization, scheduling algorithms, memory management, security, device management, deadlocks, and file systems.","prerequisites":[],"corequisites":[],"requirementsTo":[]},{"id":"COSC 5350","deptID":"COSC","courseNumber":5350,"name":"Data Communication and Networks","description":"An in-depth study of data communications and networking. Covers the architecture, design and implementation of computer networks. Topics include data transmission, switching, protocols and security.","prerequisites":[],"corequisites":[],"requirementsTo":[]},{"id":"COSC 4340","deptID":"COSC","courseNumber":4340,"name":"Comparative Study of Programming Languages","description":"Introduction, analysis, and evaluation of the important concepts found in a variety of programming language paradigms; formalisms useful in specifying language syntax and semantics; programming language paradigms including algorithmic, functional, logic, object-oriented, visual, etc.","prerequisites":["COSC 2336"],"corequisites":[],"requirementsTo":[]},{"id":"COSC 3325","deptID":"COSC","courseNumber":3325,"name":"Algorithm Analysis and Foundations","description":"Introduction to foundations and formal techniques used to support the design and analysis of algorithms, focusing on both the underlying mathematical theory and practical considerations of efficiency. Topics include asymptotic complexity bounds, techniques of analysis, algorithmic strategies, basic computability, and complexity classes.","prerequisites":["COSC 2336","MATH 2330"],"corequisites":[],"requirementsTo":["COSC 4395","COSC 4387"]},{"id":"COSC 4336","deptID":"COSC","courseNumber":4336,"name":"Software Development","description":"Provides an intensive, implementation-oriented introduction to the software development techniques used to create medium-scale interactive applications, focusing on the use of large object-oriented libraries to create well-designed graphical user interfaces. Topics include event-driven programming, computer graphics, human-computer interaction (HCI), and graphical user interfaces.","prerequisites":["COSC 2336"],"corequisites":[],"requirementsTo":["COSC 4395"]},{"id":"COSC 5325","deptID":"COSC","courseNumber":5325,"name":"Workshop in Computer Science","description":"Designed to provide instruction for groups who wish to study current specific areas in computer science. This course may be repeated once for credit when content changes. MAY NOT BE USED FOR THE MS IN COSC DEGREE.","prerequisites":[],"corequisites":[],"requirementsTo":[]},{"id":"COSC 3193","deptID":"COSC","courseNumber":3193,"name":"Computer Science Co-Op III","description":"Once a student has been approved for the co-op program, students can register for the appropriate co-op course ( COSC 3191 for the first semester, COSC 3192 for the second semester, COSC 3193 for the third semester) with the approval of the chair of computer science. A student will hold a full-time computing or information technology position for the entire semester of the co-op. During the semester of a co-op course a student will submit biweekly status reports and, in collaboration with the employer, submit at the end of the semester a performance appraisal/evaluation by the employer. Graded on a credit/no credit basis.","prerequisites":[],"corequisites":[],"requirementsTo":[]},{"id":"COSC 4370","deptID":"COSC","courseNumber":4370,"name":"Undergraduate Internship Program","description":"An 8- to 16-week program providing a new learning experience in a computer or information technology environment. A written report describing the activities and accomplishments of the student during the internship is required at the conclusion of the internship period. May be repeated once for credit. A maximum of three credit hours may be applied toward the undergraduate degree. CR/NC only.","prerequisites":[],"corequisites":[],"requirementsTo":[]},{"id":"COSC 1315","deptID":"COSC","courseNumber":1315,"name":"Programming Fundamentals for Non-CS Majors","description":"Introduction to the fundamental concepts of procedural programming. Topics covered include data types, control structures, functions, arrays, files, and the mechanics of running, testing, and debugging. This course is for non-Computer Science Majors.","prerequisites":[],"corequisites":[],"requirementsTo":["COSC 1337","COSC 2315","COSC 4327","CSCI 4332"]},{"id":"COSC 1336","deptID":"COSC","courseNumber":1336,"name":"Programming Fundamentals","description":"Introduction to the fundamental concepts of procedural programming. Topics covered include data types, control structures, functions, arrays, files, and the mechanics of running, testing, and debugging. The course also offers an introduction to the historical and social context of computing and an overview of computer science as a discipline.","prerequisites":[],"corequisites":[],"requirementsTo":["CSCI 4350","EENG 4307","COSC 1337","EENG 3305","EENG 5319","EENG 3307","EENG 5323","COSC 2315","COSC 4327","CSCI 4332","EENG 4326","EENG 5322"]},{"id":"COSC 5352","deptID":"COSC","courseNumber":5352,"name":"Client/Server Architectures","description":"Design and implementation of client/server systems. Topics include: network protocols, OLE DGE, CORBA, server design and implementation and tightly integrated message systems.","prerequisites":[],"corequisites":[],"requirementsTo":[]},{"id":"COSC 4388","deptID":"COSC","courseNumber":4388,"name":"Digital Forensics","description":"Prepares students to collect, examine, and preserve digital evidence; and examines techniques used to prepare for, respond to, and investigate cyberspace incidents. Students will use forensic software to investigate computers, mobile devices, and networks.","prerequisites":["COSC 2315"],"corequisites":[],"requirementsTo":[]},{"id":"COSC 1307","deptID":"COSC","courseNumber":1307,"name":"Introduction to Information Systems Software [TCCN: BCIS 1305]","description":"Students in this course will develop a proficiency in the use of the common applications of a productivity suite like Microsoft Office. Applications covered will include Windows, word-processing, spreadsheets, database, presentations, e-mail and the HTML editors. No prior computer experience is required.","prerequisites":[],"corequisites":[],"requirementsTo":["TECH 3324","COSC 3333","TECH 3310","GENB 2300","MANA 3300","TECH 4317","TECH 3355"]},{"id":"COSC 2315","deptID":"COSC","courseNumber":2315,"name":"Computer Organization [TCCN: COSC 2325]","description":"Introduces the concept of computers and information systems by presenting the process of computation as a hierarchy of virtual machines, beginning with the hardware and moving upward through various levels of increasingly sophisticated software.","prerequisites":["COSC 1336","COSC 1315"],"corequisites":[],"requirementsTo":["CSCI 4333","COSC 4360","COSC 4388","COSC 3355","COSC 3345","COSC 4377"]},{"id":"COSC 4327","deptID":"COSC","courseNumber":4327,"name":"UNIX Shell Programming","description":"Introduction to programming in the UNIX shells; directory structure and file manipulation, built-in functions, control structures, utilities, and sublanguages.","prerequisites":["COSC 1315","COSC 1336"],"corequisites":[],"requirementsTo":[]},{"id":"COSC 5376","deptID":"COSC","courseNumber":5376,"name":"Fundamentals of Data Warehouses","description":"This course provides an overview of the fundamentals of data warehousing including planning, designing, building, populating, and maintaining a successful data warehouse. Specific topics covered include the logical design of a data warehouse, data warehousing architecture, extract-transform-load processing, a comparison of OLAP and OLTP and query processing utilizing multidimensional views of data.","prerequisites":[],"corequisites":[],"requirementsTo":[]},{"id":"COSC 4315","deptID":"COSC","courseNumber":4315,"name":"Information and Knowledge Management","description":"The investigation of how information is a unifying theme within a range of issues in computer science, including database systems, artificial intelligence, human-computer interaction, multimedia systems, and data communication.","prerequisites":[],"corequisites":[],"requirementsTo":["COSC 4395"]},{"id":"COSC 5371","deptID":"COSC","courseNumber":5371,"name":"Data Mining","description":"Study of the concepts and techniques of data mining, or knowledge discovery in databases. The automated or convenient extraction of patterns representing knowledge implicitly stored in large databases, data warehouses, and other massive information repositories.","prerequisites":[],"corequisites":[],"requirementsTo":[]},{"id":"COSC 4312","deptID":"COSC","courseNumber":4312,"name":"ERP Architecture Using SAP","description":"Overview of the core processes, business interrelations and integration of the individual business applications within the SAP ERP eco-system. Students will perform various hands on case problems.","prerequisites":["COSC 3333","MANA 3305","MARK 3311"],"corequisites":[],"requirementsTo":[]},{"id":"COSC 4335","deptID":"COSC","courseNumber":4335,"name":"Artificial Intelligence","description":"Survey of current artificial intelligence technologies: game playing, theorem proving, pattern recognition, searching algorithms, knowledge representation, neural networks, fuzzy systems, and heuristic programming.","prerequisites":["COSC 2336"],"corequisites":[],"requirementsTo":[]},{"id":"COSC 3192","deptID":"COSC","courseNumber":3192,"name":"Computer Science Co-Op II","description":"Once a student has been approved for the co-op program, students can register for the appropriate co-op course (3191 for the first semester, 3192 for the second semester, 3193 for the third semester) with the approval of the chair of computer science. A student will hold a full-time computing or information technology position for the entire semester of the co-op. During the semester of a co-op course a student will submit biweekly status reports and, in collaboration with the employer, submit at the end of the semester a performance appraisal/evaluation by the employer. Graded on a credit/no credit basis.","prerequisites":[],"corequisites":[],"requirementsTo":[]},{"id":"COSC 3355","deptID":"COSC","courseNumber":3355,"name":"Operating Systems","description":"Fundamentals of operating systems design and implementation. Topics include an overview of the components of an operating system, mutual exclusion and synchronization, implementation of processes, scheduling algorithms, memory management, operating system security, and file systems.","prerequisites":["COSC 2315","COSC 2336"],"corequisites":[],"requirementsTo":[]},{"id":"COSC 5393","deptID":"COSC","courseNumber":5393,"name":"Graduate Seminar","description":"This course describes methods of conducting research in computer science. Current research in several different areas of computer science will be presented. Students will review and critique articles in the areas as well, focusing on their underlying principles.","prerequisites":[],"corequisites":[],"requirementsTo":[]},{"id":"COSC 5375","deptID":"COSC","courseNumber":5375,"name":"Advanced Database Design","description":"Database design issues including: query processing, interpretation, optimization, and methods for implementing and optimizing logic queries. Knowledge databases, distributed databases, and object-oriented databases.","prerequisites":[],"corequisites":[],"requirementsTo":[]},{"id":"COSC 5364","deptID":"COSC","courseNumber":5364,"name":"Cyber Risk Analysis","description":"This course is designed to teach students the basics of information systems assessment, evaluation, and red teaming. The students use the National Security Agency’s ISAM Methodology to evaluate vulnerabilities and to develop appropriate responses to mitigate security risks. The students participate in a term long assessment/evaluation project in this course with an actual organization.","prerequisites":[],"corequisites":[],"requirementsTo":[]},{"id":"COSC 5345","deptID":"COSC","courseNumber":5345,"name":"Computer Graphics","description":"An introduction to computer graphics stressing interactive graphics. Basic theory and applications will be covered. GKS graphics and an introduction to 3-D graphics will be given.","prerequisites":[],"corequisites":[],"requirementsTo":[]},{"id":"COSC 5360","deptID":"COSC","courseNumber":5360,"name":"Database Design","description":"An introduction to database systems and design. Covers relational, hierarchical, and logical database models. Topics include database modeling, design, security, management, implementation and integration.","prerequisites":[],"corequisites":[],"requirementsTo":[]},{"id":"COSC 5340","deptID":"COSC","courseNumber":5340,"name":"Programming Languages","description":"Theoretical aspects of programming languages, design and implementation criteria, analysis and classification of programming languages. Topics include: language design principles; translation and the formalization of syntax; generalization of primitive and abstract data types; sequence, data, and subprogram control; and language paradigms such as imperative, object-oriented, functional, logic, concurrent, and visual.","prerequisites":[],"corequisites":[],"requirementsTo":[]},{"id":"COSC 5363","deptID":"COSC","courseNumber":5363,"name":"Contingency Planning","description":"This course presents the principles of disaster recovery and business continuity planning, and examines countermeasures that may be used to prevent system failure for an organization. This includes the use of hot sites, warm sites, cold sites, and virtualization technology that allow the organization to continue operations after a disaster.","prerequisites":[],"corequisites":[],"requirementsTo":[]},{"id":"COSC 5384","deptID":"COSC","courseNumber":5384,"name":"Mobile Applications","description":"This course will provide a detailed overview of application development for mobile devices. It will use key concepts and basic platform requirements to start down the best path to develop a mobile application. Development in the iOS, Android, and other platforms will occur.","prerequisites":[],"corequisites":[],"requirementsTo":[]},{"id":"COSC 3191","deptID":"COSC","courseNumber":3191,"name":"Computer Science Co-Op I","description":"Once a student has been approved for the co-op program, students can register for the appropriate co-op course ( COSC 3191 for the first semester, COSC 3192 for the second semester, COSC 3193 for the third semester) with the approval of the chair of computer science. A student will hold a full-time computing or information technology position for the entire semester of the co-op. During the semester of a co-op course a student will submit biweekly status reports and, in collaboration with the employer, submit at the end of the semester a performance appraisal/evaluation by the employer. Graded on a credit/no credit basis.","prerequisites":[],"corequisites":[],"requirementsTo":[]},{"id":"COSC 4356","deptID":"COSC","courseNumber":4356,"name":"Computer Vision","description":"The course deals with extracting meaningful descriptions of physical objects from images. Topics covered include computer vision fundamentals, preprocessing techniques, feature extraction, supervised classifiers, unsupervised classifiers, and computer vision applications.","prerequisites":["COSC 2336"],"corequisites":[],"requirementsTo":[]},{"id":"COSC 4347","deptID":"COSC","courseNumber":4347,"name":"Business Intelligence and Analysis","description":"Creating value from business data by converting it into meaningful and useful information for business decision making by using current industry business intelligence (BI) and business analytics (BA) tools and technologies. Students will use various techniques to analyze data using various software systems including the Cloud environment.","prerequisites":["MATH 1342","MATH 1343"],"corequisites":[],"requirementsTo":[]},{"id":"COSC 5395","deptID":"COSC","courseNumber":5395,"name":"Thesis","description":"Selection of a research topic and development of a thesis plan. CR/NC Only.","prerequisites":[],"corequisites":[],"requirementsTo":[]},{"id":"COSC 5347","deptID":"COSC","courseNumber":5347,"name":"Business Intelligence and Analysis","description":"Creating value from business data by converting it into meaningful and useful information for business decision making by using current industry business intelligence (BI) and business analytics (BA) tools and technologies.","prerequisites":[],"corequisites":[],"requirementsTo":[]},{"id":"COSC 5356","deptID":"COSC","courseNumber":5356,"name":"Computer Vision","description":"The course deals with extracting meaningful descriptions and recognition of physical objects from digital images. Topics covered include computer vision fundamentals, edge detection, noise removal, enhancement techniques, feature extraction, supervised classifiers, unsupervised classifiers, and computer vision.","prerequisites":[],"corequisites":[],"requirementsTo":[]},{"id":"COSC 4361","deptID":"COSC","courseNumber":4361,"name":"Retail Cyber Security Management","description":"This course will cover the techniques used to secure and manage computers, computer networks and enterprise computer systems. Topics covered will include security policies, computer network management, and disaster recovery. Special emphasis will be given to designing, deploying and managing complete security systems.","prerequisites":["COSC 4325","COSC 4360"],"corequisites":[],"requirementsTo":[]},{"id":"COSC 3345","deptID":"COSC","courseNumber":3345,"name":"Computer Architecture","description":"The function and design of various components necessary to process information digitally. Topics include: Digital logic and digital systems, machine level representation of data, assembly level machine organization, memory system and organization, multiprocessing and alternative architectures.","prerequisites":["COSC 2315"],"corequisites":[],"requirementsTo":["COSC 4395"]},{"id":"COSC 5391","deptID":"COSC","courseNumber":5391,"name":"Topics in Distributed Systems","description":"Selected topics in distributed systems, computer networks, and distributed databases. Design of local area networks and multiple network systems, database programming languages, and operating systems for distributed systems.","prerequisites":[],"corequisites":[],"requirementsTo":[]},{"id":"COSC 5367","deptID":"COSC","courseNumber":5367,"name":"Cryptography","description":"This course is designed to teach students the basics related to cryptography. Topics include classical encryption, block ciphers and DES, public key cryptography, hashing, message authentication, key management, digital signatures, user authentication, transport layer security, wireless security, and e-mail security.","prerequisites":[],"corequisites":[],"requirementsTo":[]},{"id":"COSC 4387","deptID":"COSC","courseNumber":4387,"name":"Computer Performance Evaluation","description":"Discrete and continuous simulation of dynamic systems. Topics include: simulation of probabilistic systems; mathematical models of real systems; system classifications; random number generators; simulation languages; single queue and queue networks. Workloads, benchmarks, performance measurement techniques, and case studies will be used in system capacity planning, hardware selection and upgrade, and performance tuning.","prerequisites":["COSC 3325"],"corequisites":[],"requirementsTo":[]},{"id":"COSC 3310","deptID":"COSC","courseNumber":3310,"name":"Internet and Web Applications","description":"This course includes a detailed coverage of Internet protocols, Web site management, Web page design and e-commerce. The course examines the linkage of organizational strategy and electronic methods of delivering products and services in inter-organizational, national, and global environments.","prerequisites":["COSC 1337"],"corequisites":["COSC 3385"],"requirementsTo":[]},{"id":"COSC 4377","deptID":"COSC","courseNumber":4377,"name":"Compiler Techniques","description":"Characteristics of the compiling process, syntax directed compiling, symbol table construction and searching, top down and bottom up methods, formal grammars, and a formalization of syntax.","prerequisites":["COSC 2315","COSC 2336"],"corequisites":[],"requirementsTo":[]},{"id":"COSC 4390","deptID":"COSC","courseNumber":4390,"name":"Topics in Computer Science","description":"A study of new trends in computer science. Course description will vary depending on the subjects to be offered.","prerequisites":[],"corequisites":[],"requirementsTo":[]},{"id":"COSC 5377","deptID":"COSC","courseNumber":5377,"name":"Fundamentals of Modeling and Distributed Simulation of Complex Systems","description":"This course aims to teach the fundamentals of modeling, simulation, distributed simulation, and large-scale asynchronous distributed simulation of real systems on parallel processors. Examples from the real world include CAD of digital systems, IVHS transportation, military command and control, medical networks, banking networks, and asynchronous transfer mode (ATM) networks.","prerequisites":[],"corequisites":[],"requirementsTo":[]},{"id":"COSC 4381","deptID":"COSC","courseNumber":4381,"name":"Seminar in Computer Science","description":"This course is designed to study current trends in computer science or computer information systems.","prerequisites":[],"corequisites":[],"requirementsTo":[]},{"id":"COSC 5341","deptID":"COSC","courseNumber":5341,"name":"Cybersecurity","description":"This course will cover cryptography, network protocols and their application, including an overview of symmetric and asymmetric cryptographic algorithms and their use for authentication, e-mail, and e-commerce. Network security protocols covered with include Kerberos, SET, and SMIME.","prerequisites":[],"corequisites":[],"requirementsTo":[]},{"id":"COSC 4345","deptID":"COSC","courseNumber":4345,"name":"Computer Graphics","description":"Graphics hardware, software, and applications. Data structures for graphics, graphic languages, computer-aided design, and three-dimensional graphics.","prerequisites":["COSC 2336"],"corequisites":[],"requirementsTo":[]},{"id":"COSC 4373","deptID":"COSC","courseNumber":4373,"name":"Advanced Database Management Concepts","description":"A study of database management concepts from non-relational databases including object-based databases, multimedia databases, XML, and data warehouses.","prerequisites":["COSC 4385"],"corequisites":[],"requirementsTo":[]},{"id":"COSC 4362","deptID":"COSC","courseNumber":4362,"name":"Retail Cyber Security","description":"This course will give a complete coverage of cryptography, network protocols and their use in computer security. This will include an overview of symmetric and asymmetric cryptographic algorithms and their use for authentication, e-mail and e-commerce. Network security protocols covered will include Kerberos, SET and SMIME.","prerequisites":[],"corequisites":[],"requirementsTo":[]},{"id":"COSC 1301","deptID":"COSC","courseNumber":1301,"name":"Computers in Society [TCCN: COSC 1301]","description":"A general introduction to computers and their applications with emphasis on breadth of coverage. Topics include computer system components, terminology, and use of productivity tools such as word processing, spreadsheets, database, and Internet usage. Case study analysis of the social impacts of computerization and networking. Topics include computer ethics, crime, privacy, security, reliability, and vulnerability.","prerequisites":[],"corequisites":[],"requirementsTo":[]},{"id":"COSC 5334","deptID":"COSC","courseNumber":5334,"name":"ERP Architecture Using SAP","description":"The course provides a broad fundamental understanding of the core processes, business interrelations and integration of the individual business applications within the SAP ERP eco-system.","prerequisites":[],"corequisites":[],"requirementsTo":[]},{"id":"COSC 2336","deptID":"COSC","courseNumber":2336,"name":"Data Structures and Algorithms [TCCN: COSC 2336]","description":"Topics include recursion, the underlying philosophy of object-oriented programming, fundamental data structures (including stacks, queues, linked lists, hash tables, trees, and graphs), secure programming techniques, the basics of algorithmic analysis, and an introduction to the principles of language translation.","prerequisites":["COSC 1337","MATH 2413"],"corequisites":[],"requirementsTo":["COSC 4385","COSC 4360","COSC 4352","COSC 4340","COSC 3325","COSC 4336","COSC 4335","COSC 3355","COSC 4356","COSC 4377","COSC 4345"]}]